from src.wiget import mask_account_card
from src.wiget import get_data

def test_mask_account_card_1():
    '''Тесты для проверки, что функция корректно распознает
    и применяет нужный тип маскировки в зависимости от типа входных данных
    (карта или счет)'''
    pass

def test_mask_account_card_2():
    '''Параметризованные тесты с разными типами карт и счетов
    для проверки универсальности функции'''
    pass

def test_mask_account_card_3():
    '''Тестирование функции на обработку некорректных входных данных
    и проверка ее устойчивости к ошибкам'''
    pass

def test_get_data_1():
    '''Тестирование правильности преобразования даты'''
    pass

def test_get_data_2():
    '''Проверка работы функции на различных входных форматах даты,
    включая граничные случаи и нестандартные строки с датами'''
    pass

def test_get_data_3():
    '''Проверка, что функция корректно обрабатывает входные строки,
    где отсутствует дата'''
    pass