from src.widget import mask_account_card
from src.widget import get_date

def test_mask_account_card():
    '''Тесты для проверки, что функция корректно распознает
    и применяет нужный тип маскировки в зависимости от типа входных данных
    (карта или счет)'''
    pass

def test_mask_account_card():
    '''Параметризованные тесты с разными типами карт и счетов
    для проверки универсальности функции'''
    pass

def test_mask_account_card():
    '''Тестирование функции на обработку некорректных входных данных
    и проверка ее устойчивости к ошибкам'''
    pass

def test_get_date_1():
    '''Тестирование правильности преобразования даты'''
    pass

def test_get_date_2():
    '''Проверка работы функции на различных входных форматах даты,
    включая граничные случаи и нестандартные строки с датами'''
    pass

def test_get_date_3():
    '''Проверка, что функция корректно обрабатывает входные строки,
    где отсутствует дата'''
    pass